  # Data Cleaning with Pandas #

Welcome to your introduction to Pandas and Jupyter Notebook!

Today we're going to learn how to read in a csv file, create a dataframe, identify different ways it may be dirty and learn some techniques for cleaning up our data set.

karrie.anne.kehoe@gmail.com/@karriekehoe

## Getting to grips with Jupyter Notebook and Pandas

Jupyter Notebook is an interactive, browser based programing environment. It can be used for multiple programming languages, for writing documentation and visualising data. If you want to learn more about what Jupyter Notebook can read its documentation at http://jupyter-notebook.readthedocs.io/en/latest/notebook.html

Pandas is a python library, designed for statistical analysis. It's very flexible, easy to use and has a range of useful built in functions. If you want to learn more about what Pandas can do, you can read its documentation at http://pandas.pydata.org/ or browse the cook book at http://pandas.pydata.org/pandas-docs/version/0.18.1/tutorials.html

### Shortcuts:
* `esc` - takes you into command mode
* `a` - insert cell above
* `b` - insert cell below
* `shift then tab` will show you the documentation for your code
* `shift and enter` will run your cell
* ` d d` will delete a cell

### Our Data

Today we're going to look at Farm subsidaries given to Irish companies and groups from 2013. Courtesy of https://farmsubsidy.org

### Terminology ###

**Dataframe** - a dataframe is a two dimensional tabular data structure with labeled axes

**Series** - a series is similar to a list, array or a single column within a dataframe

## Starting off

First we need to import Pandas our python library to do so we use the line of code below. We use 'pd' as an alias to make it easier when typing in our code.
We are going to type 

`import pandas as pd`

In [208]:
import pandas as pd

Now we create a dataframe and read in our csv.

`df = pd.read_csv('filepath')`

In [209]:
df = pd.read_csv('/Users/karrie/Desktop/2019/DataHarvest19/IRISH_FARM.csv')

Let's look at the first ten rows of our data

`df.head(10)`

In [210]:
df.head(10)

,Name,Location,Country,Total_Amount,year,Type
0,THE IRISH DAIRY BOARD CO-OP,"Dublin,",Ireland,"€ 8,399,529.90",2013,Farm Subsidary
1,BALLYHOURA DEVELOPMENT LTD.,"Limerick,",IE,"€ 7,231,200.44",2013,Farm Subsidary
2,WEST CORK DEVELOPMENT PARTNERSHIP LTD.,"Cork,",IE,"€ 6,487,223.82",2013,Farm Subsidary
3,GALWAY RURAL DEVELOPMENT COMPANY,"Galway,",IE,"€ 6,144,907.97",2013,Farm Subsidary
4,WEXFORD LOCAL DEVELOPMENT,"Wexford,",IE,"€ 6,100,526.55",2013,Farm Subsidary
5,CO KILKENNY LEADER PARTNERSHIP,"Kilkenny,",IE,"€ 5,489,784.19",2013,Farm Subsidary
6,CLARE LOCAL DEVELOPMENT COMPANY LTD.,"Clare,",IE,"€ 5,411,178.07",2013,Farm Subsidary
7,IRD DUHALLOW LTD.,"Cork,",IE,"€ 5,379,994.02",2013,Farm Subsidary
8,SOUTH TIPPERARY LOCAL DEVELOPMENT CO LTD,"Tipperary,",IE,"€ 5,208,545.68",2013,Farm Subsidary
9,DONEGAL LOCAL DEVELOPMENT COMPANY LTD.,"Donegal,",IE,"€ 4,814,034.80",2013,Farm Subsidary

Next we need to know what data types we're dealing with for each column in our dataframe

`df.dtypes`

In [211]:
df.dtypes

Name            object
Location        object
Country         object
Total_Amount    object
 year            int64
Type            object
dtype: object

We use .shape to find the dimensions of our data

`df.shape`

In [212]:
df.shape

(480, 6)

Let's get a list of our column headers to make sure there aren't any problems with them

In [222]:
df.columns

Index(['Name', 'Location', 'Country', 'Total_Amount', ' year', 'Type '], dtype='object')

## Data Problems: 
* Location has commas in the name
* Total amount are python objects and not ints or floats, so we can't perform any calculations on them
* There is something weird looking with the year column
* The country column seems to be dirty

Before we change anything we're going to create a copy of our dataframe and clean that up

`df2.copy()`

In [213]:
df2 = df.copy()

## Cleaning strings

We need to clean up the Total amount column and convert it to an integer so we can count it. How do we check that it's worked?

`df2['col'] = df2['col'].str.replace('€', '')`

In [214]:
df2['Clean'] = df2['Total_Amount'].str.replace('€','')

In [215]:
df2.head()

,Name,Location,Country,Total_Amount,year,Type,Clean
0,THE IRISH DAIRY BOARD CO-OP,"Dublin,",Ireland,"€ 8,399,529.90",2013,Farm Subsidary,"8,399,529.90"
1,BALLYHOURA DEVELOPMENT LTD.,"Limerick,",IE,"€ 7,231,200.44",2013,Farm Subsidary,"7,231,200.44"
2,WEST CORK DEVELOPMENT PARTNERSHIP LTD.,"Cork,",IE,"€ 6,487,223.82",2013,Farm Subsidary,"6,487,223.82"
3,GALWAY RURAL DEVELOPMENT COMPANY,"Galway,",IE,"€ 6,144,907.97",2013,Farm Subsidary,"6,144,907.97"
4,WEXFORD LOCAL DEVELOPMENT,"Wexford,",IE,"€ 6,100,526.55",2013,Farm Subsidary,"6,100,526.55"

Next thing is to remove those pesky commas from our data

In [216]:
df2['Clean'] = df2['Clean'].str.replace(',', '')

In [217]:
df2.head()

,Name,Location,Country,Total_Amount,year,Type,Clean
0,THE IRISH DAIRY BOARD CO-OP,"Dublin,",Ireland,"€ 8,399,529.90",2013,Farm Subsidary,8399529.90
1,BALLYHOURA DEVELOPMENT LTD.,"Limerick,",IE,"€ 7,231,200.44",2013,Farm Subsidary,7231200.44
2,WEST CORK DEVELOPMENT PARTNERSHIP LTD.,"Cork,",IE,"€ 6,487,223.82",2013,Farm Subsidary,6487223.82
3,GALWAY RURAL DEVELOPMENT COMPANY,"Galway,",IE,"€ 6,144,907.97",2013,Farm Subsidary,6144907.97
4,WEXFORD LOCAL DEVELOPMENT,"Wexford,",IE,"€ 6,100,526.55",2013,Farm Subsidary,6100526.55

Now check to see if that worked

In [218]:
df2.dtypes

Name            object
Location        object
Country         object
Total_Amount    object
 year            int64
Type            object
Clean           object
dtype: object

It looks like the Country column is dirty too, let's clean that

In [219]:
df2['Country'].value_counts()

IE                413
Ireland            25
REP OF IRELAND     24
EIRE               18
Name: Country, dtype: int64

Let's use a string replacement to standardise our data  `df2['Col'] = df2['Col'].str.replace('x', '')`

In [223]:
df2['Country_clean'] = df2['Country'].str.replace('EIRE', 'IE')

In [226]:
df2['Country_clean'] = df2['Country_clean'].str.replace('Ireland', 'IE')
df2['Country_clean'] = df2['Country_clean'].str.replace('REP OF IRELAND', 'IE')

In [227]:
df2['Country'].value_counts()

IE    480
Name: Country, dtype: int64

## Changing data types

Ok, no luck. We need to explicitly change the data type for the new Value clean column.

`df2['Value_clean'] = pd.to_numeric(df2['Value_clean'])`

In [229]:
df2['Clean'] = pd.to_numeric(df2['Clean'])
df2.dtypes

Name              object
Location          object
Country           object
Total_Amount      object
 year              int64
Type              object
Clean            float64
Country_clean     object
dtype: object

## Dropping and re-naming columns

Let's clean up our dataframe a bit by dropping the Type column 
`df2 = df2.drop(columns="Type ")`

In [230]:
df['Type '].value_counts()

Farm Subsidary    480
Name: Type , dtype: int64

In [231]:
df2 = df2.drop(columns="Type ")
df2.head()

,Name,Location,Country,Total_Amount,year,Clean,Country_clean
0,THE IRISH DAIRY BOARD CO-OP,"Dublin,",IE,"€ 8,399,529.90",2013,8399529.90,Ireland
1,BALLYHOURA DEVELOPMENT LTD.,"Limerick,",IE,"€ 7,231,200.44",2013,7231200.44,IE
2,WEST CORK DEVELOPMENT PARTNERSHIP LTD.,"Cork,",IE,"€ 6,487,223.82",2013,6487223.82,IE
3,GALWAY RURAL DEVELOPMENT COMPANY,"Galway,",IE,"€ 6,144,907.97",2013,6144907.97,IE
4,WEXFORD LOCAL DEVELOPMENT,"Wexford,",IE,"€ 6,100,526.55",2013,6100526.55,IE

Now that's gone, let's rename the Clean column

`df2 = df2.rename(columns={'old_name': 'new_name'})`

In [232]:
df2 = df2.rename(columns={'Clean': 'Amount_Clean'})
df2.head()

,Name,Location,Country,Total_Amount,year,Amount_Clean,Country_clean
0,THE IRISH DAIRY BOARD CO-OP,"Dublin,",IE,"€ 8,399,529.90",2013,8399529.90,Ireland
1,BALLYHOURA DEVELOPMENT LTD.,"Limerick,",IE,"€ 7,231,200.44",2013,7231200.44,IE
2,WEST CORK DEVELOPMENT PARTNERSHIP LTD.,"Cork,",IE,"€ 6,487,223.82",2013,6487223.82,IE
3,GALWAY RURAL DEVELOPMENT COMPANY,"Galway,",IE,"€ 6,144,907.97",2013,6144907.97,IE
4,WEXFORD LOCAL DEVELOPMENT,"Wexford,",IE,"€ 6,100,526.55",2013,6100526.55,IE

Let's make sure there aren't any trail or leading spaces in the column names, if so this could cause havoc

`df2.columns`

In [233]:
df2.columns

Index(['Name', 'Location', 'Country', 'Total_Amount', ' year', 'Amount_Clean',
       'Country_clean'],
      dtype='object')

In [234]:
df2.head()

,Name,Location,Country,Total_Amount,year,Amount_Clean,Country_clean
0,THE IRISH DAIRY BOARD CO-OP,"Dublin,",IE,"€ 8,399,529.90",2013,8399529.90,Ireland
1,BALLYHOURA DEVELOPMENT LTD.,"Limerick,",IE,"€ 7,231,200.44",2013,7231200.44,IE
2,WEST CORK DEVELOPMENT PARTNERSHIP LTD.,"Cork,",IE,"€ 6,487,223.82",2013,6487223.82,IE
3,GALWAY RURAL DEVELOPMENT COMPANY,"Galway,",IE,"€ 6,144,907.97",2013,6144907.97,IE
4,WEXFORD LOCAL DEVELOPMENT,"Wexford,",IE,"€ 6,100,526.55",2013,6100526.55,IE

### Analysis

Now we have a lovely clean data set and let's dig in a little and see which group go the most money

In [236]:
df2.groupby('Name')['Amount_Clean'].sum()

Name
A P DILLON & CO                            442111.52
ADAMSTOWN FARM LTD                          65508.96
AGRI & HORT COLLEGE                        274087.83
AGRICULTURAL SCHOOL                        158582.32
AGRIFARM ENTERPRISES LTD                   196129.95
AIDAN & KATHLEEN TREACY LTD                113111.26
AIDAN REARDON LTD                           50715.36
ALAN MULLIGAN CONTRACTS LTD                 40383.01
ALLEN NURSERY LTD                          120237.33
AN BORD BIA                               1337958.01
ARDBOY DAIRY LTD                           120169.25
ARDENVILLE FARMS LTD                       131792.07
ARDKEENA AGRI SERVICES LTD                  46901.77
ARDNACRANEY FARMS LIMITED                   70957.38
ARDNAMOHER FARM LIMITED                     28594.80
ARTHUR SHORTEN LTD                         374740.21
ASHBOURNE MEAT PROCESSORS                 1784851.12
ATHBOY ESTABLISHMENT                       136284.99
ATHLEAGUE MEATS                            208801.11
AVONDHU BLACKWATER PARTNERSHIP LTD.       4275210.06
BALLINACOR ESTATE CO LTD                   171501.23
BALLINDURA FARMS & CO LTD                   33780.74
BALLYBRACK FARM LIMITED                     98649.31
BALLYCULLEN AGRI LIMITED                   120305.68
BALLYDURN FARMS LTD                         61190.65
BALLYFARM LTD                              117780.41
BALLYHAMLET AGRICULTURE LTD                 28359.85
BALLYHEADY FARMS LIMITED                    66221.08
BALLYHENEBRY DAIRIES LTD                   218865.98
BALLYHENEBRY FARMS LTD                     152007.71
                                             ...
THREE TREES FARM LTD                        84694.15
THURLES FRESH MILK LIMITED                  46647.81
TIR NA RI FARM LTD                          34544.21
TOM MURPHY FARM LTD                         60359.01
TOMMY MORRISSEY FARMING LTD                 38077.62
TOURNAGEEHA FARM LTD                        48872.32
TOWN OF MONAGHAN CO OP                     557745.27
UNICORN ECO FOUNDATION LTD                  36644.14
UNIQUE INVENTIONS COMPANYLTD                27369.32
UNITED HUNT CLUB                            38629.19
UNIVERSITY COLLEGE DUBLIN                   65937.14
UNIVERSITY OF LIMERICK                     249184.76
VG LAND HOLDINGS LTD                       126234.54
W I HUTCHINSON LIMITED                      63637.67
W P KEELING                                 59546.48
WARD WASTE PRODUCTS LTD                     40355.44
WATERFORD LEADER PARTNERSHIP LTD.         4760821.86
WEST CORK DEVELOPMENT PARTNERSHIP LTD.    6487223.82
WEST LIMERICK RESOURCES LTD               4622284.29
WESTERN FARMING CO OP                       43890.94
WESTMEATH COMMUNITY DEVELOPMENT LTD       2556021.35
WESTMOUNT FARMING LTD                      245981.99
WEXFORD CREAMERY LTD                       131514.48
WEXFORD LAND HOLDING                        68152.49
WEXFORD LOCAL DEVELOPMENT                 6100526.55
WHITEHORN FARM LIMITED                     189725.25
WILLIAM MOLONEY LTD                        110978.03
WILLIAM O'LEARY FARM LTD                    48396.04
WILLIAM SNOW & SONS LTD                     86542.60
WOODSGIFT FARM LTD                          68565.50
Name: Amount_Clean, Length: 473, dtype: float64

That's not very clear, let's sort the data

In [239]:
df2.groupby('Name')['Amount_Clean'].sum().sort_values(ascending=False)

Name
THE IRISH DAIRY BOARD CO-OP                 8399529.90
BALLYHOURA DEVELOPMENT LTD.                 7231200.44
WEST CORK DEVELOPMENT PARTNERSHIP LTD.      6487223.82
GALWAY RURAL DEVELOPMENT COMPANY            6144907.97
WEXFORD LOCAL DEVELOPMENT                   6100526.55
CO KILKENNY LEADER PARTNERSHIP              5489784.19
CLARE LOCAL DEVELOPMENT COMPANY LTD.        5411178.07
IRD DUHALLOW LTD.                           5379994.02
SOUTH TIPPERARY LOCAL DEVELOPMENT CO LTD    5208545.68
DONEGAL LOCAL DEVELOPMENT COMPANY LTD.      4814034.80
WATERFORD LEADER PARTNERSHIP LTD.           4760821.86
WEST LIMERICK RESOURCES LTD                 4622284.29
CILL DARA AR AGHAIDH TEO                    4530196.44
NORTH EAST KERRY LEADER PARTNERSHIP TEO     4454549.15
NORTH TIPPERARY LEADER PARTNERSHIP          4391585.54
AVONDHU BLACKWATER PARTNERSHIP LTD.         4275210.06
MEATH COMMUNITY RURAL AND SOCIAL DEV.       4094985.83
LEITRIM INTEGRATED DEVELOPMENT CO LTD       4041148.69
CAVAN-MONAGHAN LEADER                       3958816.63
CARLOW COUNTY DEVELOPMENT PARTNERSHIP LT    3897002.73
OFFALY INTEGRATED LOCAL DEV CO. LTD.        3865610.73
SOUTH WEST MAYO DEVELOPMENT COMPANY LTD     3791631.80
LAOIS COMMUNITY AND ENTERPRISE DEV          3754856.64
SOUTH AND EAST CORK AREA DEV LTD.           3464093.68
CO. SLIGO LEADER PARTNERSHIP COMPANY LTD    3394164.04
INISHOWEN DEVELOPMENT PARTNERSHIP           3393117.14
ROSCOMMON INTEGRATED DEVELOPMENT COMPANY    3330341.25
SOUTH KERRY DEVELOPMENT LTD.                3252079.53
LOUTH LEADER PARTNERSHIP                    3177939.82
CO WICKLOW COMMUNITY PARTNERSHIP            2703275.52
                                               ...
BALLYHAMLET AGRICULTURE LTD                   28359.85
CUAN MHUIRE TRUST                             28143.18
DALEVIEW FARM LTD                             28125.19
SELENE EQUESTRIAN LIMITED                     27489.54
DELOUR FARM LTD                               27451.14
UNIQUE INVENTIONS COMPANYLTD                  27369.32
FOYFIN DAIRY LIMITED                          27329.64
LOUGH ARROW ESTATES LTD                       27055.60
DAWN DAIRIES KILLARNEY MILK                   26734.50
CAIRDE CHOLAISTE IDE TEO                      26476.63
NEWCASTLE DAIRY FARM LIMITED                  26066.10
P & O MC HUGH LTD                             25849.65
JONATHAN NYHAN LTD                            25836.38
ST JOSEPH'S MONASTERY                         25763.89
DERRIN FARM LIMITED                           25616.47
GRANGE CUFFE LTD                              25546.35
LOUGHREA MART                                 25048.86
MONAGHAN FARMS LTD W M                        24869.43
COMHAR CHUMANN U CIARRAI                      24774.89
LANDBRUG                                      24719.23
KAZIMO LTD                                    24670.99
BLACKOAK FARMS LIMITED                        24355.77
BARBA GOAT FARM LIMITED                       24310.57
GLENDARA FARM LTD                             23480.69
BALLYVERASSA FARM LTD                         23130.12
CLOUGHJORDAN COMMUNITY FARM                   22860.60
DARTFIELD LTD                                 22822.52
PULLEN LTD                                    22187.19
FARRANCONNOR FARM LIMITED                     22140.52
MARIA PHELAN LTD                              22076.33
Name: Amount_Clean, Length: 473, dtype: float64

## Saving our data

Ok finally let's save our clean for the next class

`df2.to_csv('clean_data.csv', encoding='utf8')`

In [31]:
df2.to_csv('clean_data.csv', encoding='utf8')